data='''



9.1
矿泉水  2.5+2
生煎   16+16
桃和橘子 18.8
水蜜桃 11.4
剪头发 20
鲜之恋情水蜜桃雪梨汁 21
江边城外烤鱼2.5斤 160

9.2
梦之城超市 58
顺丰快递 16+14

9.6
花架耐用品  237

9.7
荣耀手机 1599

9.8
早餐杂粮煎饼 6
梦之城超市 171.8

9.9
科技城孕前检查个人支付 172+29.1
医保1 12+532.32
医保2 12+356
午饭 26.5

9.11
充话费1  200

9.12
午餐   13
四个桃  12.5
晚饭淮南牛肉汤  51.5
天猫超市   84.9

9.13
金士顿32gU盘  49.9
脆皮肉夹馍  9
如意馄饨 13

9.14
午饭茄子烧土豆  7
好人民间小吃  54

9.15
科技城医院挂号   12+12
梦之城超市  70.8+55.9
板栗  25
加油费  200
欧德福超市  68.6

9.16
科技城医院挂号    12+12
医保卡  220+83.7
梦之城超市+生煎   54.3
天猫超市洗涤剂＋内裤   112.8+46

9.22
梦之城超市    205.7
眼镜热缩圈  15.6
柚子3份各10斤 29.8+29.8+29.8
酷狗音乐包   8

9.23
剪头发  25
吴江大润发  47.7
炒板栗  20
超市   17.3
早饭  5.5
牛肉粉丝汤  10


9.24
梦之城超市    76.5


9.29
藏书羊肉    84
梦之城超市  17.5


9.30
加油费  200
过路费  95
水果  29.8+29.8+29.8+29.9+29.9






'''